In [1]:
ls

 Volume in drive C is OS
 Volume Serial Number is E4C2-09B2

 Directory of C:\Users\AKASH KARMAKAR\data science\excelr tuts\Excelr assignment code files\hypothesis testing 3

10-02-2022  00:49    <DIR>          .
10-02-2022  00:31    <DIR>          ..
10-02-2022  00:49    <DIR>          .ipynb_checkpoints
09-02-2022  04:39                87 BuyerRatio.csv
09-02-2022  04:39            13,423 Costomer+OrderForm.csv
09-02-2022  04:39               525 Cutlets.csv
10-02-2022  00:48                72 hypothesis testing assignment solution.ipynb
09-02-2022  04:39             3,487 LabTAT.csv
               5 File(s)         17,594 bytes
               3 Dir(s)  82,644,488,192 bytes free

# SOLUTION Q1

###### A F&B manager wants to determine whether there is any significant difference in the diameter of the cutlet between two units. A randomly selected sample of cutlets was collected from both units and measured? Analyze the data and draw inferences at 5% significance level. Please state the assumptions and tests that you carried out to check validity of the assumptions.

In [2]:
import pandas as pd
import numpy as np
from scipy import stats
from scipy.stats import norm

In [3]:
cutlet=pd.read_csv('Cutlets.csv')
cutlet

    Unit A  Unit B
0   6.8090  6.7703
1   6.4376  7.5093
2   6.9157  6.7300
3   7.3012  6.7878
4   7.4488  7.1522
5   7.3871  6.8110
6   6.8755  7.2212
7   7.0621  6.6606
8   6.6840  7.2402
9   6.8236  7.0503
10  7.3930  6.8810
11  7.5169  7.4059
12  6.9246  6.7652
13  6.9256  6.0380
14  6.5797  7.1581
15  6.8394  7.0240
16  6.5970  6.6672
17  7.2705  7.4314
18  7.2828  7.3070
19  7.3495  6.7478
20  6.9438  6.8889
21  7.1560  7.4220
22  6.5341  6.5217
23  7.2854  7.1688
24  6.9952  6.7594
25  6.8568  6.9399
26  7.2163  7.0133
27  6.6801  6.9182
28  6.9431  6.3346
29  7.0852  7.5459
30  6.7794  7.0992
31  7.2783  7.1180
32  7.1561  6.6965
33  7.3943  6.5780
34  6.9405  7.3875

In [4]:
cutlet.describe()

          Unit A     Unit B
count  35.000000  35.000000
mean    7.019091   6.964297
std     0.288408   0.343401
min     6.437600   6.038000
25%     6.831500   6.753600
50%     6.943800   6.939900
75%     7.280550   7.195000
max     7.516900   7.545900

In [5]:
#H0: No significant differnce between two units (dia of unit A = dia of unit B)
#Ha: significance diff more than 5% between two units (dia of unit A != dia of unit B)

unita=pd.Series(cutlet.iloc[:,0])
unitb=pd.Series(cutlet.iloc[:,1])

In [32]:
p=stats.ttest_ind(unita,unitb, alternative='two-sided') #two tail test
p

Ttest_indResult(statistic=0.7228688704678063, pvalue=0.4722394724599501)

###### solution

##### H0: No significant differnce between two units        : ACCEPTED
##### Ha: significance diff more than 5% between two units  : REJECTED

* p value=0.47 which is greater than 0.05
* so we can conclude that Ho is true.
* there is no significance difference in diameter  two units.

# SOLUTION Q2

###### A hospital wants to determine whether there is any difference in the average Turn Around Time (TAT) of reports of the laboratories on their preferred list. They collected a random sample and recorded TAT for reports of 4 laboratories. TAT is defined as sample collected to report dispatch.
   
###### Analyze the data and determine whether there is any difference in average TAT among the different laboratories at 5% significance level.

In [16]:
lab=pd.read_csv('LabTAT.csv')
lab.head()

   Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
0        185.35        165.53        176.70        166.13
1        170.49        185.91        198.45        160.79
2        192.77        194.92        201.23        185.18
3        177.33        183.00        199.61        176.42
4        193.41        169.57        204.63        152.60

In [17]:
#Ho: no significance differnce in avg TAT value between laboratories
#Ha: There is signifiance difference in avg TAT value between laboratories

In [18]:
lab.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 120 entries, 0 to 119
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Laboratory 1  120 non-null    float64
 1   Laboratory 2  120 non-null    float64
 2   Laboratory 3  120 non-null    float64
 3   Laboratory 4  120 non-null    float64
dtypes: float64(4)
memory usage: 3.9 KB

In [19]:
lab.describe()

       Laboratory 1  Laboratory 2  Laboratory 3  Laboratory 4
count    120.000000    120.000000    120.000000     120.00000
mean     178.361583    178.902917    199.913250     163.68275
std       13.173594     14.957114     16.539033      15.08508
min      138.300000    140.550000    159.690000     124.06000
25%      170.335000    168.025000    188.232500     154.05000
50%      178.530000    178.870000    199.805000     164.42500
75%      186.535000    189.112500    211.332500     172.88250
max      216.390000    217.860000    238.700000     205.18000

In [30]:
# here anova test has to be done to check the hypothesis
p=stats.f_oneway(lab['Laboratory 1'],lab['Laboratory 2'],lab['Laboratory 3'],lab['Laboratory 4'])
p[1]

2.1156708949992414e-57

###### solution

##### Ho: no significance differnce in avg TAT value between laboratories        : REJECTED
##### Ha: There is signifiance difference in avg TAT value between laboratories  : ACCEPTED

* As the p value is less than 0.05
* we can conclude that Ha is true
* Ha= There is significance differnece in avg TAT between labs.

# SOLUTION Q3

###### Sales of products in four different regions is tabulated for males and females. Find if male-female buyer rations are similar across regions.

In [25]:
br=pd.read_csv('BuyerRatio.csv')
br.head()

  Observed Values  East  West  North  South
0           Males    50   142    131     70
1         Females   435  1523   1356    750

In [26]:
br_clean= br.iloc[:,1:5]
br_clean

   East  West  North  South
0    50   142    131     70
1   435  1523   1356    750

In [27]:
br_clean.values

array([[  50,  142,  131,   70],
       [ 435, 1523, 1356,  750]], dtype=int64)

In [ ]:
#as the values are chategorical values devided into two series, chi square test for independence will be applicable.

In [87]:
from scipy.stats import chi2_contingency
p=chi2_contingency(br_clean)
p[1]

0.6603094907091882

###### solution

##### Ho: male female buyer ratio is similar across regions                            : ACCEPTED
##### Ha: male female buyer ratio is significantly different across regions   : REJECTED

* as the p value is greater than 0.05
* Ho is true
* male female buyer ratio is similar across the regions

# SOLUTION Q4

###### TeleCall uses 4 centers around the globe to process customer order forms. They audit a certain % of the customer order forms. Any error in order form renders it defective and has to be reworked before processing. The manager wants to check whether the defective % varies by centre. Please analyze the data at 5% significance level and help the manager draw appropriate inferences

In [34]:
cf=pd.read_csv('Costomer+OrderForm.csv')
cf.head()

  Phillippines   Indonesia       Malta       India
0   Error Free  Error Free   Defective  Error Free
1   Error Free  Error Free  Error Free   Defective
2   Error Free   Defective   Defective  Error Free
3   Error Free  Error Free  Error Free  Error Free
4   Error Free  Error Free   Defective  Error Free

In [35]:
# Ho: The defective % doesnot varies by center
# Ha: The defective % does varies by center

In [36]:
cf.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Phillippines  300 non-null    object
 1   Indonesia     300 non-null    object
 2   Malta         300 non-null    object
 3   India         300 non-null    object
dtypes: object(4)
memory usage: 9.5+ KB

In [37]:
cf.Phillippines.value_counts()

Error Free    271
Defective      29
Name: Phillippines, dtype: int64

In [38]:
cf.Indonesia.value_counts()

Error Free    267
Defective      33
Name: Indonesia, dtype: int64

In [39]:
cf.Malta.value_counts()

Error Free    269
Defective      31
Name: Malta, dtype: int64

In [40]:
cf.India.value_counts()

Error Free    280
Defective      20
Name: India, dtype: int64

In [41]:
#as the values are chategorical values devided into two values, chi square test for independence will be applicable.
#we have to form an array with the counts of error free and defective

e=[[271,267,269,280],[29,33,31,20]]
e

[[271, 267, 269, 280], [29, 33, 31, 20]]

In [42]:
from scipy.stats import chi2_contingency
chi2_contingency(e)[1]

0.2771020991233135

###### solution

##### Ho: The defective % doesnot varies by center  : ACCEPTED
##### Ha: The defective % does varies by center     : REJECTED

* p value= 0.277
* As the p value is greater than 0.05, Ho is true
* The defective % doesnot varies by center